# Project 1:-

#          Build Decision Tree(DV-"Survived",IDV-"Age,Gender and Fare") and Prediction

In [89]:
import os
os.path.abspath("day_24_dataset/")

'C:\\Users\\Kishor\\Desktop\\AI ML\\Day 24\\day_24_dataset'

In [90]:
import numpy as np
import pandas as pd
from sklearn import preprocessing
from sklearn import tree

In [91]:
data = pd.read_csv("C:\\Users\\Kishor\\Desktop\\AI ML\\Day 24\\day_24_dataset\\train.csv")

In [92]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [93]:
data.shape

(889, 12)

In [94]:
data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [95]:
le = preprocessing.LabelEncoder()

In [96]:
data["Sex"]=le.fit_transform(data["Sex"])

In [97]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S

In [98]:
tree_model = tree.DecisionTreeClassifier(max_depth=8)

In [99]:
predictor = pd.DataFrame([data["Sex"],data["Age"],data["Fare"]]).T

In [100]:
tree_model.fit(X=predictor,y=data["Survived"])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=8, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [101]:
with open("D_Tree.dot","w") as f:
    f=tree.export_graphviz(tree_model,feature_names=["Sex",'Age',"Faree"],out_file=f);

In [102]:
tree_model.score(X=predictor,y=data["Survived"])

0.8706411698537683

# Prediction:-

In [103]:
data1 = pd.read_csv("C:\\Users\\Kishor\\Desktop\\AI ML\\Day 24\\day_24_dataset/test.csv")

In [104]:
data1.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [105]:
data1.isna().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [106]:
le1 = preprocessing.LabelEncoder()

In [120]:
encoded_sex = le1.fit_transform(data1["Sex"])

In [121]:
data1.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [122]:
test_features = pd.DataFrame([encoded_sex,data1["Age"],data1["Fare"]]).T

In [123]:
test_preds = tree_model.predict(X = test_features)

In [126]:
predicted_output = pd.DataFrame({"Passengerid":data1["PassengerId"],"Survived":test_preds})

In [128]:
predicted_output.to_csv("output.csv",index=True)